[
  {
   "title": "Frostgrave API",
    "imageUrl": "/assets/fgapi.png",
    "language": "MongoDB/Mongoose, Express, Node.js",
    "link": "https://frostgrave-api.onrender.com/",
    "codelink": "https://github.com/tenor2000/Frostgrave-API",
    "favor": false,
    "description": "This is a RESTful API for Frostgrave, a tabletop wargame. It allows users to manage warbands, campaigns, and other game-related data. The API is built using Node.js, Express, and MongoDB, providing endpoints for CRUD operations on warbands and campaigns. It includes features like user authentication and data validation."
  },
  {
    "title": "Frostgrave Manager",
    "imageUrl": "/assets/wargamemanager.png",
    "language": "MongoDB, Express, React, Node.js",
    "link": "",
    "codelink": "https://github.com/tenor2000/FrostgraveApp",
    "favor": false,
    "description": "This is a WIP. A warband and campaign currently developed using Frostgrave second edition, with additional expansion to other tabletop wargames. Built using components from Material UI, it features a full database, and a full API. The project is currently in development, and will be released in the near future."
  },

  {
    "title": "Weather API App",
    "imageUrl": "/assets/weather.png",
    "language": "HTML, JavaScript, CSS",
    "link": "https://tenor2000.github.io/weather-api-app/",
    "codelink": "https://github.com/tenor2000/weather-api-app",
    "favor": false,
    "description": "This weather app was made to learn using API calls in vanilla JavaScript and webpack. This is optimized for desktop."
  },
  {
    "title": "Memory Card Game",
    "imageUrl": "/assets/memory.png",
    "language": "React, JavaScript, CSS",
    "link": "https://tenor2000.github.io/memory-cardgame/",
    "codelink": "https://github.com/tenor2000/memory-cardgame",
    "favor": false,
    "description": "This project involved learning React hooks and states. It connects to the free open-source PokeAPI."
  },
  {
    "title": "Etch-a-Sketch",
    "imageUrl": "/assets/etch.png",
    "language": "HTML, JavaScript, CSS",
    "link": "https://tenor2000.github.io/etch-a-sketch/",
    "codelink": "https://github.com/tenor2000/etch-a-sketch",
    "favor": false,
    "description": "The Etch-a-Sketch app is a dynamic drawing tool created using JavaScript and CSS. Users can draw on a grid by clicking and dragging their mouse over the tiles, changing the background color as they go. The app includes features like resizing the grid, clearing the drawing area, and selecting different colors from a palette. Through building this project, I gained hands-on experience in event handling, DOM manipulation, and CSS styling, enhancing my skills in web development and interactive design."
  }
]
